src/cf/Reports/НезавершенныеДействияСЧекомРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>НезавершенныеДействияСЧекомРМК</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Enums/ОперацииРабочегоМестаКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииРабочегоМестаКассира</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоВозвратаСкупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоКоррекции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоСкупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткладываниеЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеОтложенногоЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаНаПробитиеЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробитиеЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалениеЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АварийноеЗавершениеЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжениеБезРасчетаСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовышениеПравНаВозвратЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовышениеПравНаКоррекциюЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовышениеПравНаОткладываниеЧека</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/НезавершенныеДействияСЧекомРМК/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыКомпоновки = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных;
	ПараметрыКомпоновки.Элементы[0].Использование = Истина;
	СписокОпераций = ПараметрыКомпоновки.Элементы[0].Значение;
	СписокОпераций.Добавить(Перечисления.ОперацииРабочегоМестаКассира.НачалоПродажи);
	СписокОпераций.Добавить(Перечисления.ОперацииРабочегоМестаКассира.НачалоВозврата);
	СписокОпераций.Добавить(Перечисления.ОперацииРабочегоМестаКассира.НачалоВозвратаСкупки);
	СписокОпераций.Добавить(Перечисления.ОперацииРабочегоМестаКассира.НачалоКоррекции);
	СписокОпераций.Добавить(Перечисления.ОперацииРабочегоМестаКассира.НачалоСкупки);
	СписокОпераций.Добавить(Перечисления.ОперацииРабочегоМестаКассира.ОткрытиеОтложенногоЧека);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	ИнтерфейсРМКСлужебныйКлиент.ОбработкаРасшифровкиНезавершенныеДействияСЧекомРМК(ДанныеРасшифровки, Расшифровка,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
